/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   gameplay_info.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: authomas <authomas@student.42lyon.fr>      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/01/26 14:52:10 by gchauvet          #+#    #+#             */
/*   Updated: 2026/02/10 12:45:27 by authomas         ###   ########lyon.fr   */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

void	print_info(void)
{
	printf("╔══════════════════════════════════════════════════════════╗\n");
	printf("║                         ✨Info✨                         ║\n");
	printf("╠════╦═══════╦════════════════════════════════════════╦════╣\n");
	printf("║    ║  Key  ║                Action                  ║    ║\n");
	printf("║ 🧙 ║       ║                                        ║ 🧙 ║\n");
	printf("║ 🗝️  ║ WS AD ║                 move                   ║ 🗝️  ║\n");
	printf("║ 🍌 ║ left  ║           look to the left             ║ 🍌 ║\n");
	printf("║ 🔮 ║ right ║           look to the right            ║ 🔮 ║\n");
	printf("║ 🥝 ║  LMB  ║           use the magic rod            ║ 🥝 ║\n");
	printf("║ 🍄 ║  TAB  ║           hide/show the HUD            ║ 🍄 ║\n");
	printf("║ ✨ ║   C   ║             toggle noclip              ║ ✨ ║\n");
	printf("║ 🏰 ║   M   ║       toggle mouse camera control      ║ 🏰 ║\n");
	printf("║    ║       ║                                        ║    ║\n");
	printf("╚════╩═══════╩════════════════════════════════════════╩════╝\n");
}
